src/cfe/RabbitConnector8312/InformationRegisters/rabbit_НастройкиПодсистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>rabbit_НастройкиПодсистемы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АктивныйСерверRabbitMQ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ксп_Серверы_RabbitMQ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТочкаОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ксп_ТочкиОбменаRabbit</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/RabbitConnector8312/InformationRegisters/rabbit_НастройкиПодсистемы/Ext/ManagerModule.bsl
// Описание_метода
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
// Возвращаемое значение:
//	Тип: Тип_значения
//
Функция ПолучитьНастройки() Экспорт
	
	СтруктураВозврата = Новый Структура("АктивныйСерверRabbitMQ, ТочкаОбмена ");
	Запрос = Новый Запрос;
	Запрос.Текст = "Выбрать АктивныйСерверRabbitMQ, ТочкаОбмена из РегистрСведений.rabbit_НастройкиПодсистемы";
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат СтруктураВозврата;
	КонецЕсли;
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	СтруктураВозврата.АктивныйСерверRabbitMQ = Выборка.АктивныйСерверRabbitMQ;
	СтруктураВозврата.ТочкаОбмена = Выборка.ТочкаОбмена;
	Возврат СтруктураВозврата;
	
КонецФункции
